zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/source/gd32c2x1_usart.c
    if(0U != (USART_REG_VAL(usart_periph, flag) & BIT(USART_BIT_POS(flag)))) {
        status = SET;
    } else {
        status = RESET;
    }
    return status;
}

/*!
    \brief      clear USART status (API_ID: 0x0046U)
    \param[in]  usart_periph: USARTx(x=0,1,2)
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        USART_FLAG_PERR: parity error flag
      \arg        USART_FLAG_FERR: frame error flag
      \arg        USART_FLAG_NERR: noise detected flag
      \arg        USART_FLAG_ORERR: overrun error flag
      \arg        USART_FLAG_IDLE: idle line detected flag
      \arg        USART_FLAG_TC: transmission complete flag
      \arg        USART_FLAG_LBD: LIN break detected flag (only support USART0)
      \arg        USART_FLAG_CTSF: CTS change flag
      \arg        USART_FLAG_RT: receiver timeout flag (only support USART0)
      \arg        USART_FLAG_EB: end of block flag (only support USART0)
      \arg        USART_FLAG_AM: address match flag
      \arg        USART_FLAG_WU: wakeup from deep-sleep mode flag (only support USART0)
      \arg        USART_FLAG_EPERR: early parity error flag
    \param[out] none
    \retval     none
*/
void usart_flag_clear(uint32_t usart_periph, usart_flag_enum flag)
{
    USART_INTC(usart_periph) |= BIT(USART_BIT_POS(flag));
}

/*!
    \brief      enable USART interrupt (API_ID: 0x0047U)
    \param[in]  usart_periph: USARTx(x=0,1,2)
    \param[in]  interrupt: interrupt type
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_IDLE: idle interrupt
      \arg        USART_INT_RBNE: read data buffer not empty interrupt and overrun error interrupt enable interrupt
      \arg        USART_INT_TC: transmission complete interrupt
      \arg        USART_INT_TBE: transmit data register empty interrupt
      \arg        USART_INT_PERR: parity error interrupt
      \arg        USART_INT_AM: address match interrupt
      \arg        USART_INT_RT: receiver timeout interrupt (only support USART0)
      \arg        USART_INT_EB: end of block interrupt (only support USART0)
      \arg        USART_INT_LBD: LIN break detection interrupt (only support USART0)
      \arg        USART_INT_ERR: error interrupt enable in multibuffer communication
      \arg        USART_INT_CTS: CTS interrupt
      \arg        USART_INT_WU: wakeup from deep-sleep mode interrupt (only support USART0)
      \arg        USART_INT_RFF: receive FIFO full interrupt enable (only support USART0)
    \param[out] none
    \retval     none
*/
void usart_interrupt_enable(uint32_t usart_periph, usart_interrupt_enum interrupt)
{
    USART_REG_VAL(usart_periph, interrupt) |= BIT(USART_BIT_POS(interrupt));
}

/*!
    \brief      disable USART interrupt (API_ID: 0x0048U)
    \param[in]  usart_periph: USARTx(x=0,1,2)
    \param[in]  interrupt: interrupt type
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_IDLE: idle interrupt
      \arg        USART_INT_RBNE: read data buffer not empty interrupt and overrun error interrupt
      \arg        USART_INT_TC: transmission complete interrupt
      \arg        USART_INT_TBE: transmit data register empty interrupt
      \arg        USART_INT_PERR: parity error interrupt
      \arg        USART_INT_AM: address match interrupt
      \arg        USART_INT_RT: receiver timeout interrupt(only support USART0)
      \arg        USART_INT_EB: end of block interrupt(only support USART0)
      \arg        USART_INT_LBD: LIN break detection interrupt(only support USART0)
      \arg        USART_INT_ERR: error interrupt enable in multibuffer communication
      \arg        USART_INT_CTS: CTS interrupt
      \arg        USART_INT_WU: wakeup from deep-sleep mode interrupt (only support USART0)
      \arg        USART_INT_RFF: receive FIFO full interrupt enable  (only support USART0)
    \param[out] none
    \retval     none
*/
void usart_interrupt_disable(uint32_t usart_periph, usart_interrupt_enum interrupt)
{
    USART_REG_VAL(usart_periph, interrupt) &= ~BIT(USART_BIT_POS(interrupt));
}

/*!
    \brief      get USART interrupt and flag status (API_ID: 0x0049U)
    \param[in]  usart_periph: USARTx(x=0,1,2)
    \param[in]  int_flag: interrupt and flag type, refer to usart_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_FLAG_EB: end of block interrupt and flag (only support USART0)
      \arg        USART_INT_FLAG_RT: receiver timeout interrupt and flag (only support USART0)
      \arg        USART_INT_FLAG_AM: address match interrupt and flag
      \arg        USART_INT_FLAG_PERR: parity error interrupt and flag
      \arg        USART_INT_FLAG_TBE: transmitter buffer empty interrupt and flag
      \arg        USART_INT_FLAG_TC: transmission complete interrupt and flag
      \arg        USART_INT_FLAG_RBNE: read data buffer not empty interrupt and flag
      \arg        USART_INT_FLAG_RBNE_ORERR: read data buffer not empty interrupt and overrun error flag
      \arg        USART_INT_FLAG_IDLE: IDLE line detected interrupt and flag
      \arg        USART_INT_FLAG_LBD: LIN break detected interrupt and flag (only support USART0)
      \arg        USART_INT_FLAG_WU: wakeup from deep-sleep mode interrupt and flag (only support USART0)
      \arg        USART_INT_FLAG_CTS: CTS interrupt and flag
      \arg        USART_INT_FLAG_ERR_NERR: error interrupt and noise error flag
      \arg        USART_INT_FLAG_ERR_ORERR: error interrupt and overrun error
      \arg        USART_INT_FLAG_ERR_FERR: error interrupt and frame error flag
      \arg        USART_INT_FLAG_RFF: receive FIFO full interrupt and flag (only support USART0)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus usart_interrupt_flag_get(uint32_t usart_periph, usart_interrupt_flag_enum int_flag)
{
    uint32_t intenable, flagstatus;
    FlagStatus status = RESET;

